In [84]:
import pandas as pd 
import numpy as np

# 单key的merge

In [98]:
left = pd.DataFrame({'key': ['K0', 'K1', 'K2', 'K3'],
                      'A': ['A0', 'A1', 'A2', 'A3'],
                      'B': ['B0', 'B1', 'B2', 'B3']})
right = pd.DataFrame({'key': ['K0', 'K1', 'K2', 'K3'],
                        'C': ['C0', 'C1', 'C2', 'C3'],
                        'D': ['D0', 'D1', 'D2', 'D3']})

In [99]:
left

  key   A   B
0  K0  A0  B0
1  K1  A1  B1
2  K2  A2  B2
3  K3  A3  B3

In [100]:
right

  key   C   D
0  K0  C0  D0
1  K1  C1  D1
2  K2  C2  D2
3  K3  C3  D3

In [101]:
result=pd.merge(left,right,on='key')
result

  key   A   B   C   D
0  K0  A0  B0  C0  D0
1  K1  A1  B1  C1  D1
2  K2  A2  B2  C2  D2
3  K3  A3  B3  C3  D3

# 多key的merge

In [90]:
left = pd.DataFrame({'key1': ['K0', 'K0', 'K1', 'K2'],
                     'key2': ['K0', 'K1', 'K0', 'K1'],
                     'A': ['A0', 'A1', 'A2', 'A3'],
                     'B': ['B0', 'B1', 'B2', 'B3']})
right = pd.DataFrame({'key1': ['K0', 'K1', 'K1', 'K2'],
                      'key2': ['K0', 'K0', 'K0', 'K0'],
                      'C': ['C0', 'C1', 'C2', 'C3'],
                      'D': ['D0', 'D1', 'D2', 'D3']})

In [91]:
left,right

(  key1 key2   A   B
 0   K0   K0  A0  B0
 1   K0   K1  A1  B1
 2   K1   K0  A2  B2
 3   K2   K1  A3  B3,
   key1 key2   C   D
 0   K0   K0  C0  D0
 1   K1   K0  C1  D1
 2   K1   K0  C2  D2
 3   K2   K0  C3  D3)

+ 多key合并merge([key1,key2...],how=合并方式,indicator=是否显示合并方式)
    * how = inner/outer/left/right
        * indicator=True 每行合并后再最后显示这一行的合并方式
            * indicator='合并方式' 相当于设置为True & 添加列名

In [92]:
result=pd.merge(left,right,on=['key1','key2'],indicator=True) # 默认key='inner'
result

  key1 key2   A   B   C   D _merge
0   K0   K0  A0  B0  C0  D0   both
1   K1   K0  A2  B2  C1  D1   both
2   K1   K0  A2  B2  C2  D2   both

+ 只合并了key1，key2完全相同的条目
+ 栏目名字是_merge

In [93]:
result=pd.merge(left,right,on=['key1','key2'],how='outer',indicator='合并方式')
result

  key1 key2    A    B    C    D        合并方式
0   K0   K0   A0   B0   C0   D0        both
1   K0   K1   A1   B1  NaN  NaN   left_only
2   K1   K0   A2   B2   C1   D1        both
3   K1   K0   A2   B2   C2   D2        both
4   K2   K1   A3   B3  NaN  NaN   left_only
5   K2   K0  NaN  NaN   C3   D3  right_only

+ 全保留
+ 栏目名字是 '合并方式'

In [94]:
result=pd.merge(left,right,on=['key1','key2'],how='left',indicator='合并方式')
result

  key1 key2   A   B    C    D       合并方式
0   K0   K0  A0  B0   C0   D0       both
1   K0   K1  A1  B1  NaN  NaN  left_only
2   K1   K0  A2  B2   C1   D1       both
3   K1   K0  A2  B2   C2   D2       both
4   K2   K1  A3  B3  NaN  NaN  left_only

+ 按左表合并
+ 栏目名字是 '合并方式'

In [95]:
result=pd.merge(left,right,on=['key1','key2'],how='right',indicator='合并方式')
result

  key1 key2    A    B   C   D        合并方式
0   K0   K0   A0   B0  C0  D0        both
1   K1   K0   A2   B2  C1  D1        both
2   K1   K0   A2   B2  C2  D2        both
3   K2   K0  NaN  NaN  C3  D3  right_only

+ 按右表合并
+ 栏目名字是 '合并方式'

In [96]:
result=pd.merge(left,right,on=['key1','key2'],how='right',indicator='合并方式')
result

  key1 key2    A    B   C   D        合并方式
0   K0   K0   A0   B0  C0  D0        both
1   K1   K0   A2   B2  C1  D1        both
2   K1   K0   A2   B2  C2  D2        both
3   K2   K0  NaN  NaN  C3  D3  right_only

# 依据index的合并

In [108]:
left = pd.DataFrame({'A': ['A0', 'A1', 'A2'],
                      'B': ['B0', 'B1', 'B2']},
                      index=['K0', 'K1', 'K2'])
right = pd.DataFrame({'C': ['C0', 'C2', 'C3'],
                     'D': ['D0', 'D2', 'D3']},
                      index=['K0', 'K2', 'K3'])

In [109]:
left

     A   B
K0  A0  B0
K1  A1  B1
K2  A2  B2

In [110]:
right

     C   D
K0  C0  D0
K2  C2  D2
K3  C3  D3

In [111]:
res = pd.merge(left, right, left_index=True, right_index=True, how='outer')
res

      A    B    C    D
K0   A0   B0   C0   D0
K1   A1   B1  NaN  NaN
K2   A2   B2   C2   D2
K3  NaN  NaN   C3   D3

In [113]:
res = pd.merge(left, right, left_index=True, right_index=True, how='inner')
res

     A   B   C   D
K0  A0  B0  C0  D0
K2  A2  B2  C2  D2

# overlapping

In [122]:
boys = pd.DataFrame({'k': ['柜员', '会计', '主管'], 'age': [1, 2, 3]})
girls = pd.DataFrame({'k': ['柜员', '柜员', '经理'], 'age': [4, 5, 6]})

In [123]:
boys

    k  age
0  柜员    1
1  会计    2
2  主管    3

In [124]:
girls

    k  age
0  柜员    4
1  柜员    5
2  经理    6

In [125]:
res = pd.merge(boys, girls, on='k', how='outer')
res

    k  age_x  age_y
0  柜员    1.0    4.0
1  柜员    1.0    5.0
2  会计    2.0    NaN
3  主管    3.0    NaN
4  经理    NaN    6.0

+ 没有定义suffixes:  age_x - age_y

In [127]:
res = pd.merge(boys, girls, on='k', suffixes=['_boy', '_girl'], how='outer')
res

    k  age_boy  age_girl
0  柜员        1         4
1  柜员        1         5